# RbsConduitOuterDiamParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsConduitOuterDiamParam Property
ParameterTypeId Class See Also
---
"Outside Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsConduitOuterDiamParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsConduitOuterDiamParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsConduitOuterDiamParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace